using System;

namespace SP_Server
{
    /// <summary>
    /// 프로토콜 정의.
    /// 서버에서 클라이언트로 가는 패킷 : S -> C
    /// 클라이언트에서 서버로 가는 패킷 : C -> S
    /// </summary>
    public enum PROTOCOL : short
    {
        //-------------------------------------
        // 0 이하는 종료코드로 사용되므로 게임에서 쓰지 말것!!
        //-------------------------------------
        BEGIN = 0,

		LOGIN_REQ,
		LOGIN_ACK,
		ENTER_CUSTOMER_REQ,
		ENTER_CUSTOMER_ACK,

		//-------------------------------------
		// 실패 프로토콜.
		//-------------------------------------
		FAILED_NOT_NUMBER,

        //-------------------------------------
        // 로비 프로토콜.
        //-------------------------------------        
		ORDER_REQ,
		ORDER_ACK,

        //-------------------------------------
        // 게임 프로토콜.
        //-------------------------------------        
        ROOM_REMOVED,

        END,
    }        
}
